/******************************************************************************/
/*/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/

AhoTTS: A Text-To-Speech system for Basque* and Spanish*,
developed by Aholab Signal Processing Laboratory at the
University of the Basque Country (UPV/EHU). Its acoustic engine is based on
hts_engine' and it uses AhoCoder* as vocoder.
(Read COPYRIGHT_and_LICENSE_code.txt for more details)
--------------------------------------------------------------------------------

Linguistic processing for Basque and Spanish, Vocoder (Ahocoder) and
integration by Aholab UPV/EHU.

*AhoCoder is an HNM-based vocoder for Statistical Synthesizers
http://aholab.ehu.es/ahocoder/

++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Copyrights:
	1997-2012  Aholab Signal Processing Laboratory, University of the Basque
	 Country (UPV/EHU)
     *2011-2012 Aholab Signal Processing Laboratory, University of the Basque
    	  Country (UPV/EHU)


++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Licenses:
	GPL-3.0+
	*GPL-3.0+
	'Modified BSD (Compatible with GNU GPL)

			
	++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	GPL-3.0+
       	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.
	.
	This package is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	.
	You should have received a copy of the GNU General Public License
	along with this program. If not, see <http://www.gnu.org/licenses/>.
	.
	On Debian systems, the complete text of the GNU General
	Public License version 3 can be found in /usr/share/common-licenses/GPL-3.


//\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/******************************************************************************/
/**********************************************************/
/*/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*
Copyright: 1998 - TSR/Aholab (DET) ETSII/IT-Bilbao

Nombre fuente................ isofilt.c
Nombre paquete............... normalizador
Lenguaje fuente.............. C
Estado....................... desarrollo
Dependencia Hard/OS.......... -
Codigo condicional........... -

Codificacion................. Juan Luis Murugarren

Version  dd/mm/aa  Autor     Proposito de la edicion
-------  --------  --------  -----------------------
0.0.8	 03/02/14	Inaki	 Añadir diéresis y otros acentos para Francés-Iparralde: ë, ï
0.0.7	 14/10/13  Inaki	 Susutituir la cedilla 'ç' por una ese 's'
0.0.6	 29/05/13  Inaki	 No filtrar el salto de carro, para detectar párrafos
0.0.5	 02/10/07  Inaki     Añadir u con dieresis y simbolo Euro
0.0.4    02/05/01  Yon2.     lost <string.h>
0.0.3    06/04/01  Yon2.     Cedilla Bug.
0.0.2    03/11/00  Yon2.     Tres cuartos missed.
0.0.1    25/10/00  Yon2.     Aniadir funciones para acceder
                             a la tabla y filtrar buffers.
0.0.0    17/10/00  Yon2.     Codificacion inicial.

======================== Contenido ========================

Matriz de 256 elementos que filtra caracteres de la tabla
ISO 8859/Latin 1.
Los caracteres que no son de interés los convierte a
espacios, y los que tengan un sustituto se convierten.

Los menores de 32, caracteres de escape se sustituyen todos
por espacios. Incluidos el CR, el LF y el tabulador.
Del 127 al 160 son caracteres de control que también se eliminan.

No editar este archivo desde DOS con BC la página de códigos
es totalmente diferente. Es evidente que para poder ver este
archivo correctamente se necesita una tabla de caracteres en uso
ISO 8859/Latin 1

===========================================================
*/
/*/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/**********************************************************/

#include <string.h>
#include <stdio.h>
#include "isofilt.h"




/**********************************************************/
//Hay que hacer cosas raras con los punteros pues los CHAR
//tienen signo, y si entramos en la tabla con mayores de 128
//estamos entrando con negativos.!!!!!!
/**********************************************************/

CHAR char_fltr(CHAR i)
{
	void *j = &i;
//	printf("\n char:%c numero:%d --> char:char:%c numero:%d <-", i,i,(CHAR)iso8859filter[ *((pUCHAR)j)],(CHAR)iso8859filter[ *((pUCHAR)j)]);
	return (CHAR)iso8859filter[ *((pUCHAR)j)];
}

/**********************************************************/


/**********************************************************/


pCHAR buff_fltr(pCHAR buffer)
{
  INT i, len;

	len = strlen(buffer);
 	for(i=0;i< len; i++){
		if(buffer[i] != 10 && buffer[i] != 13) //inaki salto de carro
			buffer[i]=char_fltr(buffer[i]);
	}

	return buffer;
}
/**********************************************************/




/**********************************************************/


INT iso8859filter[256] = {
/* [000] C */ ' ', /* [001] C */ ' ', /* [002] C */ ' ', /* [003] C */ ' ',
/* [004] C */ ' ', /* [005] C */ ' ', /* [006] C */ ' ', /* [007] C */ ' ',
/* [008] C */ ' ', /* [009] C */ ' ', /* [010] C */ ' ', /* [011] C */ ' ',
/* [012] C */ ' ', /* [013] C */ ' ', /* [014] C */ ' ', /* [015] C */ ' ',
/* [016] C */ ' ', /* [017] C */ ' ', /* [018] C */ ' ', /* [019] C */ ' ',
/* [020] C */ ' ', /* [021] C */ ' ', /* [022] C */ ' ', /* [023] C */ ' ',
/* [024] C */ ' ', /* [025] C */ ' ', /* [026] C */ ' ', /* [027] C */ ' ',
/* [028] C */ ' ', /* [029] C */ ' ', /* [030] C */ ' ', /* [031] C */ ' ',
/* [032] C */ ' ', /* [033] ! */ '!', /* [034] " */ ',', /* [035] # */ '#',
/* [036] $ */ '$', /* [037] % */ '%', /* [038] & */ '&', /* [039] ' */ '\'',
/* [040] ( */ '(', /* [041] ) */ ')', /* [042] * */ '*', /* [043] + */ '+',
/* [044] , */ ',', /* [045] - */ '-', /* [046] . */ '.', /* [047] / */ '/',
/* [048] 0 */ '0', /* [049] 1 */ '1', /* [050] 2 */ '2', /* [051] 3 */ '3',
/* [052] 4 */ '4', /* [053] 5 */ '5', /* [054] 6 */ '6', /* [055] 7 */ '7',
/* [056] 8 */ '8', /* [057] 9 */ '9', /* [058] : */ ':', /* [059] ; */ ';',
/* [060] < */ '<', /* [061] = */ '=', /* [062] > */ '>', /* [063] ? */ '?',
/* [064] @ */ '@', /* [065] A */ 'A', /* [066] B */ 'B', /* [067] C */ 'C',
/* [068] D */ 'D', /* [069] E */ 'E', /* [070] F */ 'F', /* [071] G */ 'G',
/* [072] H */ 'H', /* [073] I */ 'I', /* [074] J */ 'J', /* [075] K */ 'K',
/* [076] L */ 'L', /* [077] M */ 'M', /* [078] N */ 'N', /* [079] O */ 'O',
/* [080] P */ 'P', /* [081] Q */ 'Q', /* [082] R */ 'R', /* [083] S */ 'S',
/* [084] T */ 'T', /* [085] U */ 'U', /* [086] V */ 'V', /* [087] W */ 'W',
/* [088] X */ 'X', /* [089] Y */ 'Y', /* [090] Z */ 'Z', /* [091] [ */ '[',
/* [092] \ */ '\\', /* [093] ] */ ']', /* [094] ^ */ '^', /* [095] _ */ '_',
/* [096] ` */ ' ', /* [097] a */ 'a', /* [098] b */ 'b', /* [099] c */ 'c',
/* [100] d */ 'd', /* [101] e */ 'e', /* [102] f */ 'f', /* [103] g */ 'g',
/* [104] h */ 'h', /* [105] i */ 'i', /* [106] j */ 'j', /* [107] k */ 'k',
/* [108] l */ 'l', /* [109] m */ 'm', /* [110] n */ 'n', /* [111] o */ 'o',
/* [112] p */ 'p', /* [113] q */ 'q', /* [114] r */ 'r', /* [115] s */ 's',
/* [116] t */ 't', /* [117] u */ 'u', /* [118] v */ 'v', /* [119] w */ 'w',
/* [120] x */ 'x', /* [121] y */ 'y', /* [122] z */ 'z', /* [123] { */ '{',
/* [124] | */ '|', /* [125] } */ '}', /* [126] ~ */ '~', /* [127] C */ ' ',

/* Prueba para Windows, por problemas con caracteres extendidos */

#if defined(WIN324) //INAKI, para q siempre use lo de linux   /* para consola win95 */
/* [128]   */ ' ', /* [129] ü */ 'ü', /* [130]   */ 'é', /* [131]   */ ' ',
/* [132]   */ ' ', /* [133]   */ ' ', /* [134]   */ ' ', /* [135] ç */ 'ç',
/* [136]   */ ' ', /* [137]   */ ' ', /* [138]   */ ' ', /* [139]   */ ' ',
/* [140]   */ ' ', /* [141]   */ ' ', /* [142]   */ ' ', /* [143]   */ ' ',
/* [144]   */ ' ', /* [145]   */ ' ', /* [146]   */ ' ', /* [147]   */ ' ',
/* [148]   */ ' ', /* [149]   */ ' ', /* [150]   */ ' ', /* [151]   */ ' ',
/* [152]   */ ' ', /* [153]   */ ' ', /* [154] Ü */ 'Ü', /* [155]   */ ' ',
/* [156]   */ ' ', /* [157]   */ ' ', /* [158]   */ ' ', /* [159]   */ ' ',
/* [160]   */ 'á', /* [161] í */ 'í', /* [162] ¢ */ 'ó', /* [163] ú */ 'ú',
/* [164] ñ */ 'ñ', /* [165] Ñ */ 'Ñ', /* [166] ª */ 'ª', /* [167] º */ 'º',
/* [168] ¿ */ '¿', /* [169] ® */ ' ', /* [170] ª */ 'ª', /* [171] ½ */ '½',
/* [172] ¼ */ '¼', /* [173] ¡ */ '¡', /* [174] « */ '\'',/* [175] » */ '\'',
/* [176]   */ '°', /* [177]   */ ' ', /* [178]   */ ' ', /* [179]   */ ' ',
/* [180]   */ ' ', /* [181] Á */ 'Á', /* [182]   */ ' ', /* [183]   */ ' ',
/* [184] © */ '©', /* [185]   */ ' ', /* [186]   */ ' ', /* [187]   */ ' ',
/* [188]   */ ' ', /* [189]   */ ' ', /* [190]   */ ' ', /* [191]   */ ' ',
/* [192]   */ ' ', /* [193]   */ ' ', /* [194]   */ ' ', /* [195]   */ ' ',
/* [196]   */ ' ', /* [197]   */ ' ', /* [198]   */ ' ', /* [199]   */ ' ',
/* [200]   */ ' ', /* [201]   */ ' ', /* [202]   */ ' ', /* [203]   */ ' ',
/* [204]   */ ' ', /* [205]   */ ' ', /* [206]   */ ' ', /* [207]   */ ' ',
/* [208]   */ ' ', /* [209]   */ ' ', /* [210]   */ ' ', /* [211]   */ ' ',
/* [212] È */ 'È', /* [213]   */ ' ', /* [214] Í */ 'Í', /* [215]   */ ' ', //213 euro?????
/* [216]   */ ' ', /* [217]   */ ' ', /* [218]   */ ' ', /* [219]   */ ' ',
/* [220]   */ ' ', /* [221]   */ ' ', /* [222]   */ ' ', /* [223]   */ ' ',
/* [224] Ó */ 'Ó', /* [225]   */ ' ', /* [226]   */ ' ', /* [227]   */ ' ',
/* [228]   */ ' ', /* [229]   */ ' ', /* [230]   */ ' ', /* [231]   */ ' ',
/* [232]   */ ' ', /* [233] Ú */ 'Ú', /* [234]   */ ' ', /* [235]   */ ' ',
/* [236]   */ ' ', /* [237]   */ ' ', /* [238]   */ ' ', /* [239]   */ ' ',
/* [240]   */ ' ', /* [241]   */ ' ', /* [242]   */ ' ', /* [243]   */ ' ',
/* [244]   */ ' ', /* [245]   */ ' ', /* [246]   */ ' ', /* [247]   */ ' ',
/* [248]   */ ' ', /* [249]   */ ' ', /* [250]   */ ' ', /* [251]   */ ' ',
/* [252]   */ ' ', /* [253]   */ ' ', /* [254]   */ ' ', /* [255]   */ ' '
};


#else //INAKI: 128 --> simbolo Euro
/* [128] ¤ */ '¤', /* [129] C */ ' ', /* [130] C */ ' ', /* [131] C */ ' ',
/* [132] C */ ' ', /* [133] C */ ' ', /* [134] C */ ' ', /* [135] C */ ' ',
/* [136] C */ ' ', /* [137] C */ ' ', /* [138] C */ ' ', /* [139] C */ ' ',
/* [140] C */ ' ', /* [141] C */ ' ', /* [142] C */ ' ', /* [143] C */ ' ',
/* [144] C */ ' ', /* [145] C */ ' ', /* [146] C */ ' ', /* [147] C */ ' ',
/* [148] C */ ' ', /* [149] C */ ' ', /* [150] C */ ' ', /* [151] C */ ' ',
/* [152] C */ ' ', /* [153] C */ ' ', /* [154] C */ ' ', /* [155] C */ ' ',
/* [156] C */ ' ', /* [157] C */ ' ', /* [158] C */ ' ', /* [159] C */ ' ',
/* [160]   */ ' ', /* [161] ¡ */ '¡', /* [162] ¢ */ ' ', /* [163] £ */ '£',
/* [164] ¤ */ '¤', /* [165] ¥ */ '¥', /* [166] ¦ */ ' ', /* [167] § */ ' ',
/* [168]   */ ' ', /* [169] © */ ' ', /* [170] ª */ 'ª', /* [171] « */ '\'',
/* [172] ¬ */ ' ', /* [173] ­ */ ' ', /* [174]   */ ' ', /* [175] ¯ */ ' ',
/* [176] ° */ '°', /* [177] ± */ '±', /* [178] ² */ '²', /* [179] ³ */ ' ',
/* [180] ´ */ ' ', /* [181] µ */ ' ', /* [182] ¶ */ ' ', /* [183] · */ ' ',
/* [184] ¸ */ '¸', /* [185] ¹ */ ' ', /* [186] º */ 'º', /* [187] » */ '\'',
/* [188] ¼ */ '¼', /* [189] ½ */ '½', /* [190] ¾ */ '¾', /* [191] ¿ */ '¿',
/* [192] À */ 'Á', /* [193] Á */ 'Á', /* [194] Â */ 'A', /* [195] Ã */ 'A',
/* [196] Ä */ 'A', /* [197] Å */ 'A', /* [198] Æ */ ' ', /* [199] Ç */ 'S',
/* [200] È */ 'É', /* [201] É */ 'É', /* [202] Ê */ 'E', /* [203] Ë */ 'E',
/* [204] Ì */ 'Í', /* [205] Í */ 'Í', /* [206] Î */ 'I', /* [207] Ï */ 'I',
/* [208] Ð */ ' ', /* [209] Ñ */ 'Ñ', /* [210] Ò */ 'Ó', /* [211] Ó */ 'Ó',
/* [212] Ô */ 'O', /* [213] Õ */ 'O', /* [214] Ö */ 'O', /* [215] × */ '×',
/* [216] Ø */ ' ', /* [217] Ù */ 'Ú', /* [218] Ú */ 'Ú', /* [219] Û */ 'U',
/* [220] Ü */ 'Ü', /* [221] Ý */ 'Y', /* [222] Þ */ ' ', /* [223] ß */ 'ß',
/* [224] à */ 'á', /* [225] á */ 'á', /* [226] â */ 'a', /* [227] ã */ 'a',
/* [228] ä */ 'a', /* [229] å */ 'a', /* [230] æ */ ' ', /* [231] ç */ 's',
/* [232] è */ 'é', /* [233] é */ 'é', /* [234] ê */ 'e', /* [235] ë */ 'e',
/* [236] ì */ 'í', /* [237] í */ 'í', /* [238] î */ 'i', /* [239] ï */ 'i',
/* [240] ð */ 'o', /* [241] ñ */ 'ñ', /* [242] ò */ 'ó', /* [243] ó */ 'ó',
/* [244] ô */ 'o', /* [245] õ */ 'o', /* [246] ö */ 'o', /* [247] ÷ */ '÷',
/* [248] ø */ ' ', /* [249] ù */ 'ú', /* [250] ú */ 'ú', /* [251] û */ 'u',
/* [252] ü */ 'ü', /* [253] ý */ 'y', /* [254] þ */ ' ', /* [255] ÿ */ 'y'
};
/**********************************************************/
#endif
/**********************************************************/
